export const questionsAndAnswers = [
  {
    text: 'А когда с человеком может произойти дрожемент?',
    answers: [
      {
        text: 'Когда он влюбляется',
        isCorrect: false
      },
      {
        text: 'Когда он идет шопиться',
        isCorrect: false
      },
      {
        text: 'Когда он слышит смешную шутку',
        isCorrect: false
      },
      {
        text: 'Когда он боится, пугается',
        isCorrect: true,
        explanation: 'Лексема «дрожемент» имплицирует состояние крайнего напряжения и страха: «У меня всегда дрожемент в ногах, когда копы подходят»'
      }
    ]
  },
  {
    text: 'Говорят, Антон заовнил всех. Это еще как понимать?',
    answers: [
      {
        text: 'Как так, заовнил? Ну и хамло. Кто с ним теперь дружить-то будет?',
        isCorrect: false
      },
      {
        text: 'Антон очень надоедливый и въедливый человек, всех задолбал',
        isCorrect: false
      },
      {
        text: 'Молодец, Антон, всех победил!',
        isCorrect: true,
        explanation: 'Термин «заовнить» заимствован из английского языка, он происходит от слова own и переводится как «победить», «завладеть», «получить»'
      },
      {
        text: 'Нет ничего плохого в том, что Антон тщательно выбирает себе друзей',
        isCorrect: false
      }
    ]
  },
  {
    text: 'А фразу «заскамить мамонта» как понимать?',
    answers: [
      {
        text: 'Разозлить кого-то из родителей',
        isCorrect: false
      },
      {
        text: 'Увлекаться археологией',
        isCorrect: false
      },
      {
        text: 'Развести недотепу на деньги',
        isCorrect: true,
        explanation: 'Заскамить мамонта — значит обмануть или развести на деньги. Почему мамонта? Потому что мошенники часто выбирают в жертвы пожилых людей (древних, как мамонты), которых легко обвести вокруг пальца.'
      },
      {
        text: 'Оскорбить пожилого человека',
        isCorrect: false
      }
    ]
  },
  {
    text: 'Кто такие бефефе?',
    answers: [
      {
        text: 'Вши?',
        isCorrect: false
      },
      {
        text: 'Милые котики, такие милые, что бефефе',
        isCorrect: false
      },
      {
        text: 'Лучшие друзья',
        isCorrect: true,
        explanation: 'Бефефе — это лучшие друзья. Этакая аббревиатура от английского выражения best friends forever.'
      },
      {
        text: 'Люди, которые не держат слово',
        isCorrect: false
      }
    ]
  }
];
